        IDENTIFICATION DIVISION.
        PROGRAM-ID. MAINPROG.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 WS-COUNTER PIC 99 VALUE 0.
        PROCEDURE DIVISION.
            PERFORM 3 TIMES
            ADD 1 TO WS-COUNTER
            DISPLAY "WS-COUNTER: " WS-COUNTER
            CALL 'SUBPROG'
            END-PERFORM
            STOP RUN.
        END PROGRAM MAINPROG.

        IDENTIFICATION DIVISION.
        PROGRAM-ID. SUBPROG.
        DATA DIVISION.
        LOCAL-STORAGE SECTION.
        01 LS-COUNTER PIC 99 VALUE 0.
        PROCEDURE DIVISION.
            ADD 1 TO LS-COUNTER
            DISPLAY "LS-COUNTER: " LS-COUNTER
            GOBACK.
        END PROGRAM SUBPROG.
