        IDENTIFICATION DIVISION.
        PROGRAM-ID. LEVEL-NUMBER.

        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 STUDENT1.
            02 NAME  PIC X(5) VALUE "LANCE".
            02 AGE   PIC 9(2) VALUE 19.
            02 GRADE PIC 9.9 VALUE 1.2.  *> represents 1.2

      * 01 GRADE-DISPLAY PIC 9.9.

        PROCEDURE DIVISION.
      *     MOVE GRADE TO GRADE-DISPLAY
            DISPLAY FUNCTION TRIM(NAME) SPACE AGE SPACE GRADE
            STOP RUN.
